programming/lisp/the-little-schemer.org
#+TITLE: Note on "The Little Schemer"
#+AUTHOR: Zhao WenBin

* Commandment

1. 用递归方式思考。注意递归的零条件，列表是 =null?= ，数字是 =zero?= ，S 表达式通过 =null?= , =atom?= 和 =car= 来判断
2. 使用 =cons= 来构造列表
3. When building a list, describe the first typical element, and then =cons= it onto the natural recursion.
4. Always change at least one argument while recurring.
5. Zero value: 0 for +, 1 for x, () for =cons=
6. Simplify only after the function is correct
7. Recur on the subparts that are of the same nature.
8. Use help functions to abstract from representations.
9. Abstract common patterns with a new function.
10. Build functions to collect more than one value at a time.

* The Five Rules

- The Law of Car :: The Primitive car is defined only for non-empty lists
- The Law of Cdr :: The primitive cdr is defined only for non-empty lists. The cdr of any non-empty list is always another list.
- The Law of Cons :: The second argument to cons must be a list. The result is a list.
- The Law of Null? :: The primitive =null?= is defined only for lists.
- The Law of Eq? :: The primitive =eq?= takes two arguments. Each must be a non-numeric atom.



