programming/lisp/the-little-schemer.org.html
<!DOCTYPE html>
<html>
  <head>
    <meta charset="utf8"></meta>
    <title>the-little-schemer.org</title>
    <link rel="stylesheet" href="/diary/resources/css/main.css" />
    <link rel="stylesheet" href="/diary/resources/highlight/styles/default.css" />
  </head>
  <body>
    <section class="main-article-area">
      <nav id='content'>
	<span id="prev">
	  	
	</span>

	<span id="home"><a href="/diary">Home</a></span>
	<span id="Up">
	  
	  <a href="/diary/programming/lisp">Up: lisp</a>
	  	
	</span>

	<span id="next">
	  	
	</span>
      </nav>
      
      <div id='main'>
	<h1 id="commandment">Commandment</h1>
<ol class="incremental">
<li>用递归方式思考。注意递归的零条件，列表是 <code>null?</code> ，数字是 <code>zero?</code> ，S 表达式通过 <code>null?</code> , <code>atom?</code> 和 <code>car</code> 来判断</li>
<li>使用 <code>cons</code> 来构造列表</li>
<li>When building a list, describe the first typical element, and then <code>cons</code> it onto the natural recursion.</li>
<li>Always change at least one argument while recurring.</li>
<li>Zero value: 0 for +, 1 for x, () for <code>cons</code></li>
<li>Simplify only after the function is correct</li>
<li>Recur on the subparts that are of the same nature.</li>
<li>Use help functions to abstract from representations.</li>
<li>Abstract common patterns with a new function.</li>
<li>Build functions to collect more than one value at a time.</li>
</ol>
<h1 id="the-five-rules">The Five Rules</h1>
<dl class="incremental">
<dt>The Law of Car</dt>
<dd>The Primitive car is defined only for non-empty lists
</dd>
<dt>The Law of Cdr</dt>
<dd>The primitive cdr is defined only for non-empty lists. The cdr of any non-empty list is always another list.
</dd>
<dt>The Law of Cons</dt>
<dd>The second argument to cons must be a list. The result is a list.
</dd>
<dt>The Law of Null?</dt>
<dd>The primitive <code>null?</code> is defined only for lists.
</dd>
<dt>The Law of Eq?</dt>
<dd>The primitive <code>eq?</code> takes two arguments. Each must be a non-numeric atom.
</dd>
</dl>

      </div>
    </section>
  </body>
</html>
